In [7]:
import numpy as np
import pandas as pd

In [8]:
import pandas as pd
import random
import string


# Regenerating the dictionary where each key (종목코드, 종목명, 현재가, 등락률) has a list of values

data_dict = {
    "종목코드": [],
    "종목명": [],
    "현재가": [],
    "등락률": []
}

# Function to generate simpler 종목코드 and 종목명 ensuring the 종목코드 starts with '0'
def generate_code_name_for_dict(existing_codes):
    while True:
        code = '0' + ''.join(random.choices(string.digits, k=5))  # Ensure it starts with '0'
        name = ''.join(random.choices(string.ascii_uppercase, k=2))  # Simpler 종목명 with 2 letters
        if code not in existing_codes:
            return code, name

# Generating 10,000 rows of data
existing_codes_for_dict = set()

for _ in range(10000):
    code, name = generate_code_name_for_dict(existing_codes_for_dict)
    existing_codes_for_dict.add(code)
    current_price = random.randint(1000, 1000000)  # Simpler current price
    change_rate = round(random.uniform(-5, 5), 2)  # Simpler change rate
    
    data_dict["종목코드"].append(code)
    data_dict["종목명"].append(name)
    data_dict["현재가"].append(current_price)
    data_dict["등락률"].append(change_rate)

# Previewing a portion of the dictionary
data_dict_preview = {k: data_dict[k][:5] for k in data_dict}

df2 = pd.DataFrame(data_dict_preview)
df2

     종목코드 종목명     현재가   등락률
0  064653  OG  881259 -0.12
1  039715  BT   30947  1.58
2  066623  ZN  677090 -0.20
3  062429  ZH   80945 -1.38
4  090597  XI  913410 -3.46

In [6]:
df2.head(3)

     종목코드 종목명     현재가   등락률
0  078350  GG  652527 -4.24
1  006266  GW  706866 -0.09
2  022224  JC  347050 -4.23

In [8]:
df2.tail(3)

     종목코드 종목명     현재가   등락률
2  022224  JC  347050 -4.23
3  002518  UL  413330 -0.10
4  080381  HL  398232 -1.13

In [11]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   종목코드    5 non-null      object
 1   종목명     5 non-null      object
 2   현재가     5 non-null      int64
 3   등락률     5 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 292.0+ bytes

In [12]:
df2.describe()

                 현재가       등락률
count       5.000000  5.000000
mean   422065.000000  0.930000
std    227152.480245  1.766621
min    180592.000000 -1.750000
25%    300249.000000  0.170000
50%    349675.000000  1.400000
75%    511265.000000  2.200000
max    768544.000000  2.630000

In [ ]:
data2 = {
    "종목코드" : ['039900', '039910', '039920'], 
    "종목명" : ["알파코", "A", "B"], 
    "현재가" : [10000000, 500000, 1000], 
    "등락률" : [10.05, 1.05, 1.28]
}

df2 = pd.DataFrame(data = data2)
df2

In [13]:
# 종목코드 - index 처리
df2 = df2.set_index("종목코드")
df2

       종목명     현재가   등락률
종목코드
031982  HU  768544 -1.75
066245  TE  349675  1.40
059603  GP  300249  0.17
089737  EI  511265  2.20
041508  XA  180592  2.63

In [15]:
# reset 되어서 원래의 col 형태로 돌아감
df2.reset_index()
# df2.reset_index(drop =True)을 하게 되면 삭제됨

     종목코드 종목명     현재가   등락률
0  031982  HU  768544 -1.75
1  066245  TE  349675  1.40
2  059603  GP  300249  0.17
3  089737  EI  511265  2.20
4  041508  XA  180592  2.63

In [16]:
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05], 
    ["A", 500000, 1.05], 
    ["B", 1000, 1.28]
]

# 이런식으로 index 를 따로 지정하면 .set_index와는 다르게 index 생성
index = ["039900", "039910", "039900"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

        종목명       현재가    등락률
039900  알파코  10000000  10.05
039910    A    500000   1.05
039900    B      1000   1.28

In [21]:
df.index

Index(['039900', '039910', '039900'], dtype='object')

In [18]:
df.values

array([['알파코', 10000000, 10.05],
       ['A', 500000, 1.05],
       ['B', 1000, 1.28]], dtype=object)

In [20]:
df.values.shape

(3, 3)

In [22]:
# 각각의 col에 접근 (1)
df.현재가

039900    10000000
039910      500000
039900        1000
Name: 현재가, dtype: int64

In [23]:
# 각각의 col에 접근 (2)
df['현재가']

039900    10000000
039910      500000
039900        1000
Name: 현재가, dtype: int64

In [25]:
# 각각의 col에 접근 (3) / dataframe 형태 
df[['현재가']]

             현재가
039900  10000000
039910    500000
039900      1000

## 로우 인덱싱
- iloc, loc
    + loc : label (이름) 기반
    + iloc : index (위치) 기반

In [3]:
import seaborn as sns
sns.__version__

'0.12.2'

In [4]:
iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [28]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [30]:
# iris.loc[행, 열]
iris.loc[[0,1],:]

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [32]:
iris.loc[[0,9],['sepal_width','species']]

   sepal_width species
0          3.5  setosa
9          3.1  setosa

In [33]:
iris.iloc[[0,9],[1,4]] # 이런 경우 주석을 달아야하고, 확인하기 어렵기 때문에 loc 쓰는것이 좋음

   sepal_width species
0          3.5  setosa
9          3.1  setosa

In [46]:
# 일종의 조건식 
# 값을 가져오고 싶다면 , true값만 가져옴
# iris['sepal_width'] > 3.5
# .reset_index를 통해서 인덱스 깔끔하게 정리

result = iris.loc[iris['sepal_width'] >= 4.0, :].reset_index(drop = True) 
result

   sepal_length  sepal_width  petal_length  petal_width species
0           5.8          4.0           1.2          0.2  setosa
1           5.7          4.4           1.5          0.4  setosa
2           5.2          4.1           1.5          0.1  setosa
3           5.5          4.2           1.4          0.2  setosa

In [52]:
result2 = iris.loc[iris['sepal_width']>3.5,['sepal_length','sepal_width']].reset_index(drop = True)
pd.set_option('display.max_rows',None)

result2

    sepal_length  sepal_width
0            5.0          3.6
1            5.4          3.9
2            5.4          3.7
3            5.8          4.0
4            5.7          4.4
5            5.4          3.9
6            5.7          3.8
7            5.1          3.8
8            5.1          3.7
9            4.6          3.6
10           5.2          4.1
11           5.5          4.2
12           4.9          3.6
13           5.1          3.8
14           5.1          3.8
15           5.3          3.7
16           7.2          3.6
17           7.7          3.8
18           7.9          3.8

In [57]:
# 문자열 기반으로 조회

result = iris.loc[iris['species']== 'setosa',:].reset_index(drop = True).head(3)
result

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [60]:
# 다중조건
# iris.loc[(조건식1) & (조건식2),:] 이런 형식으로 써놓고 하면 놓치는 것들을 줄일 수 있음
iris.loc[(iris['species']== 'setosa') & (iris['sepal_width'] >= 4.0),:]

    sepal_length  sepal_width  petal_length  petal_width species
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
32           5.2          4.1           1.5          0.1  setosa
33           5.5          4.2           1.4          0.2  setosa

In [61]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [75]:
iris.loc[(iris['species']== 'versicolor') &
         (iris['sepal_width'] >= 3.0) &
         (iris['petal_width'] >= 6.2),:].reset_index(drop = True)

Empty DataFrame
Columns: [sepal_length, sepal_width, petal_length, petal_width, species]
Index: []

## 칼럼 추가하기~

In [81]:
iris_co = iris.copy()
iris_co['newCol']= 0
iris_co.head()

   sepal_length  sepal_width  petal_length  petal_width species  newCol
0           5.1          3.5           1.4          0.2  setosa       0
1           4.9          3.0           1.4          0.2  setosa       0
2           4.7          3.2           1.3          0.2  setosa       0
3           4.6          3.1           1.5          0.2  setosa       0
4           5.0          3.6           1.4          0.2  setosa       0

In [85]:
# 직접적인 사칙연산이 바로 가능함
iris_co['sepals'] = iris_co['sepal_length'] + iris_co['sepal_width']
iris_co.head()

,sepal_length,sepal_width,petal_length,petal_width,species,newCol,sepals
0,5.1,3.5,1.4,0.2,setosa,0,8.6
1,4.9,3.0,1.4,0.2,setosa,0,7.9
2,4.7,3.2,1.3,0.2,setosa,0,7.9
3,4.6,3.1,1.5,0.2,setosa,0,7.7
4,5.0,3.6,1.4,0.2,setosa,0,8.6

In [86]:
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05], 
    ["A", 500000, 1.05], 
    ["B", 1000, 1.28]
]

# 이런식으로 index 를 따로 지정하면 .set_index와는 다르게 index 생성
index = ["039900", "039910", "039900"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df

        종목명       현재가    등락률
039900  알파코  10000000  10.05
039910    A    500000   1.05
039900    B      1000   1.28

In [89]:
# axis = 0, 행을 처리함
# axis = 1, 열을 처리함
df.drop('039900',axis = 0)
# df.drop('039900',axis = 1)은 문법 에러 뜸

       종목명     현재가   등락률
039910   A  500000  1.05

In [90]:
df.drop('종목명', axis=1, inplace = True)
# inplace = True를 쓰면 할당하는게 없는걸로 쓰여져 있어서 코드 전체 흐름에서 약간 달라짐

In [91]:
df

             현재가    등락률
039900  10000000  10.05
039910    500000   1.05
039900      1000   1.28

## 칼럼명 변경

In [93]:
from pandas import DataFrame

data = [
    ["알파코", 10000000, 10.05], 
    ["A", 500000, 1.05], 
    ["B", 1000, 1.28]
]

# 이런식으로 index 를 따로 지정하면 .set_index와는 다르게 index 생성
index = ["039900", "039910", "039900"]
columns = ["종목명", "현재가", "등락률"]
df = DataFrame(data=data, index=index, columns=columns)
df2 = df.rename(columns = {'종목명' :'code'})
df2

       code       현재가    등락률
039900  알파코  10000000  10.05
039910    A    500000   1.05
039900    B      1000   1.28

In [107]:
data = [
    ["1,000", "1,100", '1,510'],
    ["1,410", "1,420", '1,790'],
    ["850", "900", '1,185'],
]
columns = ["03/02", "03/03", "03/04"]
df = DataFrame(data=data, columns=columns)
df

   03/02  03/03  03/04
0  1,000  1,100  1,510
1  1,410  1,420  1,790
2    850    900  1,185

In [105]:
def rm_comma(x):
    return int(x.replace(','," "))

In [109]:
result = df.apply(rm_comma)
result

TypeError: cannot convert the series to <class 'int'>

## 데이터 내보내기

In [5]:
iris.to_csv('iris_240930.csv',index=False) # index=false로 안하면 index col으로 저장됨

## 데이터 불러오기

In [9]:
df = pd.read_csv('iris_240930.csv')
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [10]:
!pip install openpyxl
import openpyxl

iris.to_excel('iris_excel_240930.xlsx',index=False)

Requirement already satisfied: openpyxl in /Users/parkhyuniee/anaconda3/lib/python3.11/site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in /Users/parkhyuniee/anaconda3/lib/python3.11/site-packages (from openpyxl) (1.1.0)

In [11]:
excel_df = pd.read_excel('iris_excel_240930.xlsx').head()
excel_df

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa